var city = [
	{
		'name' : '马来西亚',
		'num' : '0060'
	},
	{
		'name' : '印度尼西亚',
		'num' : '0062'
	},
	{
		'name' : '菲律宾',
		'num' : '0063'
	},
	{
		'name' : '新加坡',
		'num' : '0065'
	},
	{
		'name' : '泰国',
		'num' : '0066'
	},
	{
		'name' : '文莱',
		'num' : '00673'
	},
	{
		'name' : '日本',
		'num' : '0081'
	},
	{
		'name' : '韩国',
		'num' : '0082'
	},
	{
		'name' : '越南',
		'num' : '0084'
	},
	{
		'name' : '朝鲜',
		'num' : '00850'
	},
	{
		'name' : '香港',
		'num' : '00852'
	},
	{
		'name' : '澳门',
		'num' : '00853'
	},
	{
		'name' : '柬埔寨',
		'num' : '00855'
	},
	{
		'name' : '老挝',
		'num' : '00856'
	},
	{
		'name' : '中国',
		'num' : '0086'
	},
	{
		'name' : '台湾',
		'num' : '00886'
	},
	{
		'name' : '孟加拉国',
		'num' : '00880'
	},
	{
		'name' : '土耳其',
		'num' : '0090'
	},
	{
		'name' : '印度',
		'num' : '0091'
	},
	{
		'name' : '巴基斯坦',
		'num' : '0092'
	},
	{
		'name' : '阿富汗',
		'num' : '0093'
	},
	{
		'name' : '斯里兰卡',
		'num' : '0094'
	},
	{
		'name' : '缅甸',
		'num' : '0095'
	},
	{
		'name' : '马尔代夫',
		'num' : '00960'
	},
	{
		'name' : '黎巴嫩',
		'num' : '00961'
	},
	{
		'name' : '约旦',
		'num' : '00962'
	},
	{
		'name' : '叙利亚',
		'num' : '00963'
	},
	{
		'name' : '伊拉克',
		'num' : '00964'
	},
	{
		'name' : '科威特',
		'num' : '00965'
	},
	{
		'name' : '沙特阿拉伯',
		'num' : '00966'
	},
	{
		'name' : '阿曼',
		'num' : '00968'
	},
	{
		'name' : '以色列',
		'num' : '00972'
	},
	{
		'name' : '巴林',
		'num' : '00973'
	},
	{
		'name' : '卡塔尔',
		'num' : '00974'
	},
	{
		'name' : '不丹',
		'num' : '00975'
	},
	{
		'name' : '蒙古',
		'num' : '00976'
	},
	{
		'name' : '尼泊尔',
		'num' : '00977'
	},
	{
		'name' : '伊朗',
		'num' : '0098'
	},
	{
		'name' : '俄罗斯',
		'num' : '007'
	},
	{
		'name' : '希腊',
		'num' : '0030'
	},
	{
		'name' : '荷兰',
		'num' : '0031'
	},
	{
		'name' : '比利时',
		'num' : '0032'
	},
	{
		'name' : '法国',
		'num' : '0033'
	},
	{
		'name' : '西班牙',
		'num' : '0034'
	},
	{
		'name' : '直布罗陀',
		'num' : '00350'
	},
	{
		'name' : '葡萄牙',
		'num' : '00351'
	},
	{
		'name' : '卢森堡',
		'num' : '00352'
	},
	{
		'name' : '爱尔兰',
		'num' : '00353'
	},
	{
		'name' : '冰岛',
		'num' : '00354'
	},
	{
		'name' : '阿尔巴尼亚',
		'num' : '00355'
	},
	{
		'name' : '马耳他',
		'num' : '00356'
	},
	{
		'name' : '塞浦路斯',
		'num' : '00357'
	},
	{
		'name' : '芬兰',
		'num' : '00358'
	},
	{
		'name' : '保加利亚',
		'num' : '00359'
	},
	{
		'name' : '匈牙利',
		'num' : '0036'
	},
	{
		'name' : '德国',
		'num' : '0049'
	},
	{
		'name' : '南斯拉夫',
		'num' : '00338'
	},
	{
		'name' : '意大利',
		'num' : '0039'
	},
	{
		'name' : '圣马力诺',
		'num' : '00223'
	},
	{
		'name' : '梵蒂冈',
		'num' : '00396'
	},
	{
		'name' : '罗马尼亚',
		'num' : '0040'
	},
	{
		'name' : '瑞士',
		'num' : '0041'
	},
	{
		'name' : '列支敦士登',
		'num' : '004175'
	},
	{
		'name' : '奥地利',
		'num' : '0043'
	},
	{
		'name' : '英国',
		'num' : '0044'
	},
	{
		'name' : '丹麦',
		'num' : '0045'
	},
	{
		'name' : '瑞典',
		'num' : '0046'
	},
	{
		'name' : '挪威',
		'num' : '0047'
	},
	{
		'name' : '波兰',
		'num' : '0048'
	},
	{
		'name' : '埃及',
		'num' : '0020'
	},
	{
		'name' : '摩洛哥',
		'num' : '00210'
	},
	{
		'name' : '阿尔及利亚',
		'num' : '00213'
	},
	{
		'name' : '突尼斯',
		'num' : '00216'
	},
	{
		'name' : '利比亚',
		'num' : '00218'
	},
	{
		'name' : '冈比亚',
		'num' : '00220'
	},
	{
		'name' : '塞内加尔',
		'num' : '00221'
	},
	{
		'name' : '毛里塔尼亚',
		'num' : '00222'
	},
	{
		'name' : '马里',
		'num' : '00223'
	},
	{
		'name' : '几内亚',
		'num' : '00224'
	},
	{
		'name' : '科特迪瓦',
		'num' : '00225'
	},
	{
		'name' : '布基拉法索',
		'num' : '00226'
	},
	{
		'name' : '尼日尔',
		'num' : '00227'
	},
	{
		'name' : '多哥',
		'num' : '00228'
	},
	{
		'name' : '贝宁',
		'num' : '00229'
	},
	{
		'name' : '毛里求斯',
		'num' : '00230'
	},
	{
		'name' : '利比里亚',
		'num' : '00231'
	},
	{
		'name' : '塞拉利昂',
		'num' : '00232'
	},
	{
		'name' : '加纳',
		'num' : '00233'
	},
	{
		'name' : '尼日利亚',
		'num' : '00234'
	},
	{
		'name' : '乍得',
		'num' : '00235'
	},
	{
		'name' : '中非',
		'num' : '00236'
	},
	{
		'name' : '喀麦隆',
		'num' : '00237'
	},
	{
		'name' : '佛得角',
		'num' : '00238'
	},
	{
		'name' : '圣多美',
		'num' : '00239'
	},
	{
		'name' : '普林西比',
		'num' : '00239'
	},
	{
		'name' : '赤道几内亚',
		'num' : '00240'
	},
	{
		'name' : '加蓬',
		'num' : '00241'
	},
	{
		'name' : '刚果',
		'num' : '00242'
	},
	{
		'name' : '扎伊尔',
		'num' : '00243'
	},
	{
		'name' : '安哥拉',
		'num' : '00244'
	},
	{
		'name' : '几内亚比绍',
		'num' : '00245'
	},
	{
		'name' : '阿森松',
		'num' : '00247'
	},
	{
		'name' : '塞舌尔',
		'num' : '00248'
	},
	{
		'name' : '苏丹',
		'num' : '00249'
	},
	{
		'name' : '卢旺达',
		'num' : '00250'
	},
	{
		'name' : '埃塞俄比亚',
		'num' : '00251'
	},
	{
		'name' : '索马里',
		'num' : '00252'
	},
	{
		'name' : '吉布提',
		'num' : '00253'
	},
	{
		'name' : '肯尼亚',
		'num' : '00254'
	},
	{
		'name' : '坦桑尼亚',
		'num' : '00255'
	},
	{
		'name' : '乌干达',
		'num' : '00256'
	},
	{
		'name' : '布隆迪',
		'num' : '00257'
	},
	{
		'name' : '莫桑比克',
		'num' : '00258'
	},
	{
		'name' : '赞比亚',
		'num' : '00260'
	},
	{
		'name' : '马达加斯加',
		'num' : '00261'
	},
	{
		'name' : '留尼旺岛',
		'num' : '00262'
	},
	{
		'name' : '津巴布韦',
		'num' : '00263'
	},
	{
		'name' : '纳米比亚',
		'num' : '00264'
	},
	{
		'name' : '马拉维',
		'num' : '00265'
	},
	{
		'name' : '莱索托',
		'num' : '00266'
	},
	{
		'name' : '博茨瓦纳',
		'num' : '00267'
	}, 
	{
		'name' : '斯威士兰',
		'num' : '00268'
	},
	{
		'name' : '科摩罗',
		'num' : '00269'
	},
	{
		'name' : '南非',
		'num' : '0027'
	},
	{
		'name' : '圣赫勒拿',
		'num' : '00290'
	}, 
	{
		'name' : '阿鲁巴岛',
		'num' : '00297'
	},
	{
		'name' : '法罗群岛',
		'num' : '00298'
	},
	{
		'name' : '美国',
		'num' : '001'
	},
	{
		'name' : '加拿大',
		'num' : '001'
	}, 
	{
		'name' : '中途岛',
		'num' : '001808'
	},
	{
		'name' : '夏威夷',
		'num' : '001808'
	},
	{
		'name' : '威克岛',
		'num' : '001808'
	},
	{
		'name' : '安圭拉岛',
		'num' : '001809'
	}, 
	{
		'name' : '维尔京群岛',
		'num' : '001809'
	}, 
	{
		'name' : '圣卢西亚',
		'num' : '001809'
	},
	{
		'name' : '波多黎各',
		'num' : '001809'
	},
	{
		'name' : '牙买加',
		'num' : '001809'
	},
	{
		'name' : '巴哈马',
		'num' : '001809'
	},
	{
		'name' : '巴巴多斯',
		'num' : '001809'
	}, 
	{
		'name' : '阿拉斯加',
		'num' : '001907'
	},
	{
		'name' : '格陵兰岛',
		'num' : '00299'
	},
	{
		'name' : '福克兰群岛',
		'num' : '00500'
	}, 
	{
		'name' : '伯利兹',
		'num' : '00501'
	},
	{
		'name' : '危地马拉',
		'num' : '00502'
	}, 
	{
		'name' : '萨尔瓦多',
		'num' : '00503'
	},
	{
		'name' : '洪都拉斯',
		'num' : '00504'
	},
	{
		'name' : '尼加拉瓜',
		'num' : '00505'
	},
	{
		'name' : '哥斯达黎加',
		'num' : '00506'
	}, 
	{
		'name' : '巴拿马',
		'num' : '00507'
	},
	{
		'name' : '海地',
		'num' : '00509'
	},
	{
		'name' : '秘鲁',
		'num' : '0051'
	},
	{
		'name' : '墨西哥',
		'num' : '0052'
	}, 
	{
		'name' : '古巴',
		'num' : '0053'
	},
	{
		'name' : '阿根廷',
		'num' : '0054'
	}, 
	{
		'name' : '巴西',
		'num' : '0055'
	},
	{
		'name' : '智利',
		'num' : '0056'
	},
	{
		'name' : '哥伦比亚',
		'num' : '0057'
	}, 
	{
		'name' : '委内瑞拉',
		'num' : '0058'
	},
	{
		'name' : '玻利维亚',
		'num' : '00591'
	},
	{
		'name' : '圭亚那',
		'num' : '00592'
	},
	{
		'name' : '厄瓜多尔',
		'num' : '00593'
	}, 
	{
		'name' : '法属圭亚那',
		'num' : '00594'
	}, 
	{
		'name' : '巴拉圭',
		'num' : '00595'
	},
	{
		'name' : '马提尼克',
		'num' : '00596'
	}, 
	{
		'name' : '苏里南',
		'num' : '00597'
	},
	{
		'name' : '乌拉圭',
		'num' : '00598'
	},
	{
		'name' : '澳大利亚',
		'num' : '0061'
	},
	{
		'name' : '新西兰',
		'num' : '0064'
	},
	{
		'name' : '关岛',
		'num' : '00671'
	},
	{
		'name' : '科科斯岛',
		'num' : '006722'
	},
	{
		'name' : '诺福克岛',
		'num' : '006723'
	},
	{
		'name' : '圣诞岛',
		'num' : '006724'
	},
	{
		'name' : '瑙鲁',
		'num' : '00674'
	},
	{
		'name' : '汤加',
		'num' : '00676'
	},
	{
		'name' : '所罗门群岛',
		'num' : '00677'
	}, 
	{
		'name' : '瓦努阿图',
		'num' : '00678'
	},
	{
		'name' : '斐济',
		'num' : '00679'
	},
	{
		'name' : '科克群岛',
		'num' : '00682'
	}, 
	{
		'name' : '纽埃岛',
		'num' : '00683'
	},
	{
		'name' : '东萨摩亚',
		'num' : '00684'
	}, 
	{
		'name' : '西萨摩亚',
		'num' : '00685'
	},
	{
		'name' : '基里巴斯',
		'num' : '00686'
	},
	{
		'name' : '图瓦卢',
		'num' : '00688'
	}
]